import matplotlib.pyplot as plt
import numpy as np

# 分别存放所有点的横坐标和纵坐标，一一对应

# 4_3epoch时，效果有所下降
loss_list = [0.0347, 0.0223, 0.0214, 0.0186, 0.0171, 0.0154, 0.0148, 0.0136, 0.0127, 0.0120,
             0.0115, 0.0108, 0.0102, 0.0099, 0.0093, 0.0090, 0.0087, 0.0083, 0.0082, 0.0078,
             0.0075, 0.0073, 0.0070, 0.0068, 0.0066, 0.0064, 0.0062, 0.0061, 0.0061, 0.0059,
             0.0057, 0.0056, 0.0054, 0.0052, 0.0051, 0.0050, 0.0049, 0.0049, 0.0048, 0.0047,
             0.0046, 0.0045, 0.0045, 0.0044, 0.0044, 0.0043, 0.0043, 0.0042, 0.0042, 0.0041,
             0.0040, 0.0040, 0.0040, 0.0039, 0.0039, 0.0039, 0.0038, 0.0038, 0.0038, 0.0037]

dice_list = [0.4097, 0.5156, 0.5327, 0.5754, 0.6036, 0.6429, 0.6632, 0.6815, 0.7017, 0.7192,
             0.7308, 0.7465, 0.7588, 0.7687, 0.7841, 0.7932, 0.7985, 0.8072, 0.8124, 0.8207,
             0.8271, 0.8336, 0.8388, 0.8457, 0.8503, 0.8559, 0.8598, 0.8612, 0.8642, 0.8689,
             0.8704, 0.8768, 0.8799, 0.8833, 0.8880, 0.8894, 0.8927, 0.8937, 0.8944, 0.8970,
             0.8997, 0.9020, 0.9045, 0.9049, 0.9057, 0.9075, 0.9094, 0.9108, 0.9107, 0.9135,
             0.9153, 0.9141, 0.9155, 0.9177, 0.9168, 0.9183, 0.9205, 0.9203, 0.9210, 0.9225]
x_list = np.arange(1, len(loss_list) + 1)
# 创建图并命名
plt.figure('Line fig')
ax = plt.gca()

# 画连线图，以x_list中的值为横坐标，以y_list中的值为纵坐标
# 参数c指定连线的颜色，linewidth指定连线宽度，alpha指定连线的透明度

# plt.plot(x_list, loss_list, color='green', linestyle='--', marker='>', linewidth=0.5)
plt.plot(x_list, dice_list, color='red', linestyle='--', marker='d', linewidth=0.5)
plt.xlabel('Epoch' + '/' + str(len(x_list)))
# plt.ylabel('Loss')
plt.ylabel('Dice')
# plt.title("Loss Convergence Curve")
plt.title("Dice Convergence Curve")

plt.grid()  # 生成网格
plt.show()
